BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega4808.PIC
        <edc:SFRDef edc:_addr="0x89" edc:access="-----nnn" edc:cname="INTCTRL" edc:nzwidth="0x8" ltx:memberofperipheral="BOD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VLMIE" edc:desc="voltage level monitor interrrupt enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VLMCFG" edc:desc="Configuration" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="BELOW" edc:desc="Interrupt when supply goes below VLM level" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ABOVE" edc:desc="Interrupt when supply goes above VLM level" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="CROSS" edc:desc="Interrupt when supply crosses VLM level" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x8A" edc:access="-------n" edc:cname="INTFLAGS" edc:nzwidth="0x8" ltx:memberofperipheral="BOD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VLMIF" edc:desc="Voltage level monitor interrupt flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x8B" edc:access="-------n" edc:cname="STATUS" edc:nzwidth="0x8" ltx:memberofperipheral="BOD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VLMS" edc:desc="Voltage level monitor status" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x8C" edc:offset="0x14"/>
        <edc:SFRDef edc:_addr="0xA0" edc:access="-nnn-nnn" edc:cname="CTRLA" edc:nzwidth="0x8" ltx:memberofperipheral="VREF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC0REFSEL" edc:desc="AC0 reference select" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="0V55" edc:desc="Voltage reference at 0.55V" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="1V1" edc:desc="Voltage reference at 1.1V" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="2V5" edc:desc="Voltage reference at 2.5V" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="4V34" edc:desc="Voltage reference at 4.34V" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="1V5" edc:desc="Voltage reference at 1.5V" edc:when="(field &amp; 0x7) == 0x04"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC0REFSEL" edc:desc="ADC0 reference select" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="0V55" edc:desc="Voltage reference at 0.55V" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="1V1" edc:desc="Voltage reference at 1.1V" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="2V5" edc:desc="Voltage reference at 2.5V" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="4V34" edc:desc="Voltage reference at 4.34V" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="1V5" edc:desc="Voltage reference at 1.5V" edc:when="(field &amp; 0x7) == 0x04"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA1" edc:access="-----nnn" edc:cname="CTRLB" edc:nzwidth="0x8" ltx:memberofperipheral="VREF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC0REFEN" edc:desc="AC0 DACREF reference enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC0REFEN" edc:desc="ADC0 reference enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NVMREFEN" edc:desc="NVM reference enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xA2" edc:offset="0x1E"/>
        <edc:SFRDef edc:_addr="0xC0" edc:access="----nnnn" edc:cname="CTRLA" edc:nzwidth="0x8" ltx:memberofperipheral="NVMBIST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="NOCMD" edc:desc="No effect" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="START" edc:desc="Start BIST testing" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="RESTART" edc:desc="Re-start BIST testing" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="BREAK" edc:desc="Stop BIST and go to BREAK state" edc:when="(field &amp; 0x7) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SAF" edc:desc="Stop at fault" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC1" edc:access="-nnnnnnn" edc:cname="ADDRPAT" edc:nzwidth="0x8" ltx:memberofperipheral="NVMBIST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XMODE" edc:desc="X address mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="STATIC" edc:desc="X static" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="CARRY" edc:desc="Carry/borrow from Y" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="INC" edc:desc="X increment each cycle" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="DEC" edc:desc="X decrement each cycle" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="YMODE" edc:desc="Y address mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="STATIC" edc:desc="Y static" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="CARRY" edc:desc="Carry/borrow from X" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="INC" edc:desc="Y increment each cycle" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="DEC" edc:desc="Y decrement each cycle" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="AMODE" edc:desc="Address mode" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="No special address pattern" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="COMPLEMENT" edc:desc="Post complement address" edc:when="(field &amp; 0x7) == 0x4"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC2" edc:access="------nn" edc:cname="DATAPAT" edc:nzwidth="0x8" ltx:memberofperipheral="NVMBIST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PATTERN" edc:desc="Data check pattern" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="ZEROES" edc:desc="All flash programmed" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="CHECK" edc:desc="Physical checkerboard in flash" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="INVCHECK" edc:desc="Inverse physical checkerboard in flash" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="ONES" edc:desc="All flash unprogrammed" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC3" edc:access="----rrrr" edc:cname="STATUS" edc:nzwidth="0x8" ltx:memberofperipheral="NVMBIST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STATE" edc:desc="FSM State" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Reset state" edc:when="(field &amp; 0xF) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="BREAK" edc:desc="Break command used" edc:when="(field &amp; 0xF) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="FAILED0" edc:desc="Test failed, data from last address" edc:when="(field &amp; 0xF) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="FAILED1" edc:desc="Test failed, data from address-1" edc:when="(field &amp; 0xF) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="FAILED2" edc:desc="Test failed, data from address-2" edc:when="(field &amp; 0xF) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="SUCCESS" edc:desc="Test success" edc:when="(field &amp; 0xF) == 0x7"/>
                <edc:SFRFieldSemantic edc:cname="START0" edc:desc="Startup, fetching first data" edc:when="(field &amp; 0xF) == 0x8"/>
                <edc:SFRFieldSemantic edc:cname="START1" edc:desc="Startup, fetching second data" edc:when="(field &amp; 0xF) == 0x9"/>
                <edc:SFRFieldSemantic edc:cname="RESTART0" edc:desc="Re-start from BREAK or FAILED2" edc:when="(field &amp; 0xF) == 0xA"/>
                <edc:SFRFieldSemantic edc:cname="RESTART1" edc:desc="Re-start from FAILED1" edc:when="(field &amp; 0xF) == 0xB"/>
                <edc:SFRFieldSemantic edc:cname="RUNNING" edc:desc="Test running" edc:when="(field &amp; 0xF) == 0xC"/>
                <edc:SFRFieldSemantic edc:cname="FINISH0" edc:desc="Check last word" edc:when="(field &amp; 0xF) == 0xE"/>
                <edc:SFRFieldSemantic edc:cname="FINISH1" edc:desc="Count faults in last word" edc:when="(field &amp; 0xF) == 0xF"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC4" edc:access="-----nnnnnnnnnnn" edc:cname="CNT" edc:nzwidth="0x10" ltx:memberofperipheral="NVMBIST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CNT" edc:desc="Faults counter" edc:nzwidth="0xB"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC6" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="END" edc:nzwidth="0x20" ltx:memberofperipheral="NVMBIST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="END" edc:nzwidth="0x18"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
