BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega4808.PIC
        <edc:SFRDef edc:_addr="0x1B7" edc:access="nnnnnnnn" edc:cname="USERTCB3" edc:nzwidth="0x8" ltx:memberofperipheral="EVSYS">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel selector" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL0" edc:desc="Connect user to event channel 0" edc:when="(field &amp; 0xFF) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL1" edc:desc="Connect user to event channel 1" edc:when="(field &amp; 0xFF) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL2" edc:desc="Connect user to event channel 2" edc:when="(field &amp; 0xFF) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL3" edc:desc="Connect user to event channel 3" edc:when="(field &amp; 0xFF) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL4" edc:desc="Connect user to event channel 4" edc:when="(field &amp; 0xFF) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL5" edc:desc="Connect user to event channel 5" edc:when="(field &amp; 0xFF) == 0x6"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x1B8" edc:offset="0x8"/>
        <edc:SFRDef edc:_addr="0x1C0" edc:access="-n-----n" edc:cname="CTRLA" edc:nzwidth="0x8" ltx:memberofperipheral="CCL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1C1" edc:access="-----nnn" edc:cname="SEQCTRL0" edc:nzwidth="0x8" ltx:memberofperipheral="CCL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEQSEL" edc:desc="Sequential Selection" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Sequential logic disabled" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DFF" edc:desc="D FlipFlop" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="JK" edc:desc="JK FlipFlop" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="LATCH" edc:desc="D Latch" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="RS" edc:desc="RS Latch" edc:when="(field &amp; 0x7) == 0x04"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x1C2" edc:offset="0x3"/>
        <edc:SFRDef edc:_addr="0x1C5" edc:access="nnnnnnnn" edc:cname="INTCTRL0" edc:nzwidth="0x8" ltx:memberofperipheral="CCL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTMODE0" edc:desc="Interrupt Mode for LUT0" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Sense both edges" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense falling edge" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense rising edge" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="INTMODE1" edc:desc="Interrupt Mode for LUT1" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Sense both edges" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense falling edge" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense rising edge" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="INTMODE2" edc:desc="Interrupt Mode for LUT2" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Sense both edges" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense falling edge" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense rising edge" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="INTMODE3" edc:desc="Interrupt Mode for LUT3" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Sense both edges" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense falling edge" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense rising edge" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x1C6" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x1C7" edc:access="----nnnn" edc:cname="INTFLAGS" edc:nzwidth="0x8" ltx:memberofperipheral="CCL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT" edc:desc="Interrupt Flags" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
